export const locale = {
  lang: 'fa',
  data: {
    NOTIFICATION : {
      CHANGED_SUCCESSFULLY : 'با موفقیت تغییر یافت',
      ADDED_SUCCESSFULLY : 'با موفقیت اضافه شد' ,
      DELETED_SUCCESSFULLY : 'با موفقیت حذف شد' ,
      SCENARIO_EDIT_ERROR : 'اشکال در تغییر روند',
      SCENARIO_ADD_ERROR : 'اشکال در اضافه کردن روند',
      DUPLICATE_MODULE_ERROR : 'یک ماژول با این شماره سریال موجود است',
      MODULE_ADD_ERROR : 'اشکال در اضافه کردن ماژول',
      MODULE_CHANGE_ERROR : 'اشکال در تغییر ماژول',
      DUPLICATE_DEVICE_ERROR : 'یک دستگاه با این شماره سریال موجود است',
      CONNECTED_SUCCESSFULLY : 'با موفقیت وصل شدید',
      CONNECT_ERROR : 'خطا در اتصال به شبکه',
      DELETE_ERROR : 'خطا در حذف کردن'

    },
    GENERAL : {
      TODAY : 'امروز',
      MODULE : 'ماژول' ,
      RGB_LAMP : 'لامپ چند رنگ',
      SAVE : 'ذخیره' ,
      BACK_TO_HOME : 'بازگشت به خانه' ,
      BACK_TO_SETTINGS : 'بازگشت به تنظیمات' ,
      NOTIFICATION_TEXT : 'تغییر با مشکل رو به رو شد . برای اطلاعات بیشتر ',
      CLICK_IT : 'کلیک کنید',
      LAMPS : 'لامپ ها' ,
      LAMP: 'لامپ',
      SMART_PLUG : 'پریز هوشمند',
      SMART_PLUGS_REPORT : 'گزارش پریز های هوشمند',
      SCENARIO : 'روند' ,
      ACTIVE_SESSIONS : 'نشست های فعال' ,
      RESTART: 'شروع مجدد',
      RELOAD : 'بارگیری مجدد',
      CURTAIN : 'پرده' ,
      LOADING : 'درحال بارگزاری' ,
      ERROR : 'اشکال' ,
      CAMERA : 'دوربین' ,
      SMART_CURTAIN : 'پرده هوشمند' ,
      SMART_LAMP : 'لامپ هوشمند' ,
      WINDOW_AND_DOOR : 'در و پنجره' ,
      CHANGED_SUCCESSFULLY : 'با موفقیت تغییر یافت' ,
      NAME : 'نام' ,
      STATE : 'وضعیت',
      WEEK : {
        SATURDAY : 'شنبه' ,
        SUNDAY : 'یکشنبه' ,
        MONDAY : 'دوشنبه' ,
        TUESDAY : 'سه شنبه' ,
        WEDNESDAY : 'چهارشنبه' ,
        THURSDAY : 'پنجشنبه' ,
        FRIDAY : 'جمعه' ,
      },
      EMPTY_LAMPS: 'در این اتاق هیچ لامپی وجود ندارد',
      EMPTY_DEVICES: "در این اتاق هیچ وسیله هوشمندی وجود ندارد",
      EMPTY_WINDOOR: "در این اتاق هیچ در و پنجره هوشمندی وجود ندارد",
      EMPTY_SP: "در این اتاق هیچ پریز هوشمندی وجود ندارد",
      PRICE_UNIT: 'تومان'
    },
    CAMERA : {
      LIVE : 'زنده',
      EMPTY: 'هیج دوربینی وجود ندارد',
      SELECT_CAMERA: 'یک دوربین را انتخاب کنید'
    },
    DASHBOARD : {
      WINDOOR_QUICK_ACCESS :{
        STATUS : 'وضعیت در و پنجره ها' ,
        TAP : 'برای نمایش ضربه بزنید',
      },
      ALL_WINDOORS : {
        REPORT : 'گزارش در و پنجره ها' ,
        OPENED : 'در و پنجره های باز' ,
        CLOSED : 'در و پنجره های بسته' ,
      },
      ENERGY_ERROR : 'خطا در دریافت اطلاعات خانه',
      HOME_ENERGY : 'انرژی مصرفی خانه' ,
      LAST_MONTH : 'ماه گذشته',
      LAST_DAY : '24 ساعت گذشته' ,
      GENERATE_REPORT : 'گزارش تفصیلی'
    },
    HOME : {
      LOOKUP:{
        LAMPS: 'روشنایی',
        GADGETS : 'ابزارها' ,
        DOORS_AND_WINDOORS : 'در و پنجره ها' ,
        SMART_PLUGS : 'پریز های هوشمند' ,
        TAP_SMART_PLUG : 'برای نمایش اطلاعات پریز هوشمند کلیک کنید',
        SELECT_ROOM : 'یک قسمت را انتخاب کنید',
        NO_MODULE : 'این اتاق هیچ ماژول هوشمندی ندارد🙄',
      },
      MODAL :{
        M_ERROR : 'در دریافت اطلاعات خانه مشکل به وجود آمده است' ,
        RELOAD_IT : 'لطفاً با استفاده از دکمه زیر ، برنامه را مجدداً اجرا کنید',
        CONNECT_WIFI : 'یا به شبکه وایفای خود متصل شوید'
      },
      ERROR : 'مشکلی به وجود آمده است!' ,
    },
    DETAILS : {
      IS_PROBLEM : 'مشکلی دارید ؟' ,
      ERROR_REASON : 'معمولاً به خاطر شبکه ی اینترنت مشکلاتی به وجود می آید',
      NETWORK_CONNECT : 'مطمئن باشید که به اینترنت متصل هستید' ,
      RECONNECT_WIFI : 'دوباره به وایفای متصل شوید' ,
      RESTART : 'با استفاده از دکمه زیر ، برنامه را مجدداً اجرا کنید',
    },
    SCENARIO : {
      SCENARIO_CARD : {
        ACTIVE_QUESTION : 'فعال شود ؟' ,
        ACTIVATED : 'با موفقیت فعال شد',
        ERROR : 'فعال نشد',
        ACTIVATING: 'در حال فعالسازی...'
      },
      ACTIVE_STATE : 'حالت فعال' ,
      STAY_SAME : 'بدون اهمیت',
      NO_SCENARIO : 'روندی موجود نیست !'
    },
    CAMERAS: {
      NO_CAMERAS: 'هیچ دوربینی یافت نشد',
      SCAN: 'جستوجوی مجدد'
    },
    SETTINGS : {
      ADDITIONAL_PANELS : {
        CAMERAS : 'دوربین ها',
        DASHBOARD : 'داشبورد' ,
        MUSICS: 'موسیقی',
        GENERAL : 'اصلی',
        YOUR_HOME : 'خانه شما' ,
        HOME : 'خانه' ,
        SCENARIOS : 'روند ها' ,
        MODULES : 'ماژول ها' ,
        ACTIVE_SESSIONS : 'نشست های فعال',
      },
      SETTINGS_CARD : {
        CLICK_AGAIN : 'برای تأیید مجدداً کلیک کنید',
        ADD :{
          NEW_MODULE : 'اضافه کردن ماژول جدید' ,
          NEW_CAMERA : 'اضافه کردن دوربین جدید' ,
        },
        AUTO_DETECT: "در حال تشخیص خودکار...",
        AUTO_DETECT_FAILED: "بردی تشخیص داده نشد، لطفا سریال را دستی وارد کنید"
      },
      CAMERA_SETTING : {
        TITLE : 'دوربین',
      },
      GENERAL_SETTINGS : {
        THEMES : 'تم ها',
        THEME:{
          LIGHT : 'روشن' ,
          DARK : 'تیره' ,
        }
      },
      HOME_SETTINGS : {
        ADD_TITLE : 'اضافه کردن دستگاه جدید' ,
      },
      SCENARIO_SETTINGS : {
        ADD_TITLE : 'اضافه کردن روند جدید' ,
        TITLE : 'روند'
      },
      FORM :{
        ADD_NEW_DEVICE : 'اضافه کردن دستگاه جدید',
        ADD_NEW_WINDOOR : 'اضافه کردن در و پنجره جدید' ,
        ADD_NEW_MODULE : 'اضافه کردن ماژول جدید',
        EDIT_LED : 'ویرایش لامپ',
        EDIT_CURTAIN : 'ویرایش پرده',
        EDIT_WINDOOR : 'ویرایش در و پنجره ها',
        EDIT_MODULE : 'ویرایش ماژول',
        NAME : 'نام' ,
        SERIAL_NUMBER: 'شماره سریال',
        PIN : 'پین',
        RELY : 'رله',
        IP : 'آدرس',
        EDIT : 'ویرایش' ,
        ADD : 'افزودن'
      }
    },
    SMART_PLUG :{
      LOOKUP :{
        VOLTAGE : 'ولتاژ' ,
        CURRENT : 'جریان' ,
        ENERGY : 'انرژی'
      },
      TIME : {
        LAST_24_HOURS : 'شبانه روز گذشته' ,
        ONE_WEEK : 'هفته گذشته' ,
        ONE_MONTH : 'ماه گذشته' ,
        TWO_MONTHS : 'دوماه گذشته'
      } ,
      DATE : {
        START : 'روز شروع',
        END : 'روز پایان'
      },
      USAGE_PERCENTAGE : 'درصد استفاده' ,
      ALL_SMART_PLUGS : 'همه پریز های هوشمند' ,
      SELECT_RANGE : ' یک بازه را انتخاب کنید' ,
      CONSUMPTION_IN : 'مصرف در',
      APPROX_PRICE : 'قیمت تخمینی در' ,
      TOTAL : 'مجموع' ,
      INSTANTANEOUS : 'لحظه ای' ,
      GENERATE_REPORT : 'گزارش' ,
      PRICE : 'قیمت (2 ماه گذشته)',
      MOST_USAGE : 'بیشترین مصرف' ,
      PEAK : 'اوج مصرف' ,
      REPORT : 'گزارش پریز هوشمند',
      CONSUMPTION : 'میزان مصرف' ,
      NAME : 'نام',
      USAGE : 'مصرف' ,
      CONSUMED : 'مصرف شده' ,
      SITUATION : {
        GOOD : 'خوب' ,
        BAD : 'بد'
      }
    },
    HEADER:{
      DEVICES : {
        MAKE_SURE : 'مطمئن شوید که به <span class="wifi">{{ wifi }}</span> وصل هستید ' ,
        SCAN_QR : 'کد کیو آر زیر را اسکن کنید' ,
        ENTER : 'یا آدرس  ' ,
        IN_BROWSER : ' را در مرورگر خود وارد کنید',
      },
      SELECT_WIFI : 'یک وایفای را انتخاب کنید' ,
      USING_LAN : 'یا با کابل متصل شوید' ,
      WIFI_PASSWORD_TITLE : 'رمز عبور را وارد کنید',
      PASSWORD : 'رمز عبور',
      CONNECT : 'اتصال'
    },
    WEATHER : {
      CITY : 'مشهد' ,
      STATUS : {
        RAIN : 'بارانی' ,
        DRIZZLE : 'باران ریز' ,
        SNOW : 'برفی' ,
        MIST : 'گرد و غبار' ,
        DUST : 'گرد و خاک' ,
        FOG : 'مه آلود' ,
        HAZE : 'مه آلود' ,
        SMOKE : 'مه آلود' ,
        CLEAR : 'صاف' ,
        SAND : 'صاف' ,
        CLOUDS : 'ابری',
        TORNADO : 'طوفانی' ,
        SQUALL : 'طوفانی' ,
        ASH : 'گرد و خاک' ,
        THUNDERSTORM : 'طوفانی'
      }
    },
    WINDOOR : {
      OPEN : 'باز' ,
      CLOSE : 'بسته'
    }
  }
}
